[
  {
    "section": "Section 1",
    "title": "Title and extent of operation of the Code",
    "description": "This Act shall be called the Indian Penal Code, and shall extend to the whole of India.",
    "punishment": "Not Applicable",
    "category": "Introduction",
    "chapter": "Chapter I",
    "keywords": ["title", "extent", "operation", "commencement"],
    "severity": "none",
    "bailable": "Not Applicable",
    "cognizable": "Not Applicable",
    "relatedSections": ["Section 2", "Section 3", "Section 4"],
    "caseStudies": []
  },
  {
    "section": "Section 2",
    "title": "Punishment of offences committed within India",
    "description": "Every person shall be liable to punishment under this Code and not otherwise for every act or omission contrary to the provisions thereof, of which he shall be guilty within India.",
    "punishment": "As specified for the particular offence.",
    "category": "Introduction",
    "chapter": "Chapter I",
    "keywords": ["jurisdiction", "offence within India", "liability"],
    "severity": "none",
    "bailable": "Not Applicable",
    "cognizable": "Not Applicable",
    "relatedSections": ["Section 1", "Section 3", "Section 4"],
    "caseStudies": []
  },
  {
    "section": "Section 3",
    "title": "Punishment of offences committed beyond, but which by law may be tried within, India",
    "description": "Any person liable, by any Indian law, to be tried for an offence committed beyond India shall be dealt with according to the provisions of this Code for any act committed beyond India in the same manner as if such act had been committed within India.",
    "punishment": "As specified for the particular offence.",
    "category": "Introduction",
    "chapter": "Chapter I",
    "keywords": ["extra-territorial jurisdiction", "offence outside India"],
    "severity": "none",
    "bailable": "Not Applicable",
    "cognizable": "Not Applicable",
    "relatedSections": ["Section 1", "Section 2", "Section 4"],
    "caseStudies": []
  },
  {
    "section": "Section 4",
    "title": "Extension of Code to extra-territorial offences",
    "description": "The provisions of this Code apply also to any offence committed by—(1) any citizen of India in any place without and beyond India; (2) any person on any ship or aircraft registered in India wherever it may be; (3) any person in any place without and beyond India committing offence targeting a computer resource located in India.",
    "punishment": "As specified for the particular offence.",
    "category": "Introduction",
    "chapter": "Chapter I",
    "keywords": ["extra-territorial offences", "citizen of India", "ship or aircraft", "computer resource"],
    "severity": "none",
    "bailable": "Not Applicable",
    "cognizable": "Not Applicable",
    "relatedSections": ["Section 1", "Section 2", "Section 3"],
    "caseStudies": []
  },
  {
    "section": "Section 21",
    "title": "Public servant",
    "description": "The words 'public servant' denote a person falling under any of the descriptions hereinafter following, namely:— Every Commissioned Officer in the Military, Naval or Air Forces; Every Judge; Every officer of a Court of Justice; Every juryman, assessor, or member of a panchayat; Every arbitrator; Every person empowered to place or keep any person in confinement; Every officer of the Government whose duty it is to prevent offences, to give information of offences, to bring offenders to justice, or to protect the public health, safety or convenience; and various other categories as defined in the section.",
    "punishment": "This is a definition section and does not prescribe a punishment itself.",
    "category": "General Explanations",
    "chapter": "Chapter II",
    "keywords": ["public servant", "government officer", "judge", "police"],
    "severity": "none",
    "bailable": "Not Applicable",
    "cognizable": "Not Applicable",
    "relatedSections": ["Section 161-171 (Repealed)", "Section 166"],
    "caseStudies": ["P.V. Narasimha Rao v. State (CBI/SPE)"]
  },
  {
    "section": "Section 34",
    "title": "Acts done by several persons in furtherance of common intention",
    "description": "When a criminal act is done by several persons in furtherance of the common intention of all, each of such persons is liable for that act in the same manner as if it were done by him alone.",
    "punishment": "Same as the principal offence committed.",
    "category": "General Explanations",
    "chapter": "Chapter II",
    "keywords": ["common intention", "joint liability", "group crime"],
    "severity": "depends on the main offence",
    "bailable": "Depends on the main offence",
    "cognizable": "Depends on the main offence",
    "relatedSections": ["Section 120A", "Section 149"],
    "caseStudies": ["Barendra Kumar Ghosh v. King Emperor", "Mahbub Shah v. Emperor"]
  },
  {
    "section": "Section 120A",
    "title": "Definition of criminal conspiracy",
    "description": "When two or more persons agree to do, or cause to be done,— (1) an illegal act, or (2) an act which is not illegal by illegal means, such an agreement is designated a criminal conspiracy: Provided that no agreement except an agreement to commit an offence shall amount to a criminal conspiracy unless some act besides the agreement is done by one or more parties to such agreement in pursuance thereof.",
    "punishment": "See Section 120B",
    "category": "Criminal Conspiracy",
    "chapter": "Chapter VA",
    "keywords": ["conspiracy", "agreement", "illegal act"],
    "severity": "depends on the object of the conspiracy",
    "bailable": "Depends on the offence conspired",
    "cognizable": "Depends on the offence conspired",
    "relatedSections": ["Section 120B", "Section 34", "Section 107"],
    "caseStudies": ["State (NCT of Delhi) v. Navjot Sandhu"]
  },
  {
    "section": "Section 120B",
    "title": "Punishment of criminal conspiracy",
    "description": "(1) Whoever is a party to a criminal conspiracy to commit an offence punishable with death, imprisonment for life or rigorous imprisonment for a term of two years or upwards, shall, where no express provision is made in this Code for the punishment of such a conspiracy, be punished in the same manner as if he had abetted such offence. (2) Whoever is a party to a criminal conspiracy other than a criminal conspiracy to commit an offence punishable as aforesaid shall be punished with imprisonment of either description for a term not exceeding six months, or with fine or with both.",
    "punishment": "Same as for abetment of the offence; or imprisonment up to 6 months, or fine, or both.",
    "category": "Criminal Conspiracy",
    "chapter": "Chapter VA",
    "keywords": ["punishment for conspiracy", "abetment"],
    "severity": "depends on the offence conspired",
    "bailable": "Depends on the offence conspired",
    "cognizable": "Depends on the offence conspired",
    "relatedSections": ["Section 120A", "Section 109"],
    "caseStudies": ["Kehar Singh & Ors. v. State (Delhi Administration)"]
  },
  {
    "section": "Section 121",
    "title": "Waging, or attempting to wage war, or abetting waging of war, against the Government of India",
    "description": "Whoever, wages war against the Government of India, or attempts to wage such war, or abets the waging of such war, shall be punished with death, or imprisonment for life and shall also be liable to fine.",
    "punishment": "Death, or imprisonment for life, and fine.",
    "category": "Offences against the State",
    "chapter": "Chapter VI",
    "keywords": ["waging war", "insurrection", "rebellion", "sedition"],
    "severity": "high",
    "bailable": "Non-bailable",
    "cognizable": "Cognizable",
    "relatedSections": ["Section 121A", "Section 122", "Section 123"],
    "caseStudies": []
  },
  {
    "section": "Section 124A",
    "title": "Sedition",
    "description": "Whoever, by words, either spoken or written, or by signs, or by visible representation, or otherwise, brings or attempts to bring into hatred or contempt, or excites or attempts to excite disaffection towards the Government established by law in India, shall be punished with imprisonment for life, to which fine may be added, or with imprisonment which may extend to three years, to which fine may be added, or with fine.",
    "punishment": "Imprisonment for life and fine, or imprisonment for up to 3 years and fine, or fine.",
    "category": "Offences against the State",
    "chapter": "Chapter VI",
    "keywords": ["sedition", "disaffection", "hatred", "contempt", "government"],
    "severity": "high",
    "bailable": "Non-bailable",
    "cognizable": "Cognizable",
    "relatedSections": ["Section 153A", "Section 505"],
    "caseStudies": ["Kedar Nath Singh v. State of Bihar"]
  },
  {
    "section": "Section 141",
    "title": "Unlawful assembly",
    "description": "An assembly of five or more persons is designated an “unlawful assembly”, if the common object of the persons composing that assembly is— First.—To overawe by criminal force, or show of criminal force, the Central or any State Government or Parliament or the Legislature of any State, or any public servant in the exercise of the lawful power of such public servant; or Second.—To resist the execution of any law, or of any legal process; or Third.—To commit any mischief or criminal trespass, or other offence; or Fourth.—By means of criminal force, or show of criminal force, to any person, to take or obtain possession of any property, or to deprive any person of the enjoyment of a right of way, or of the use of water or other incorporeal right of which he is in possession or enjoyment, or to enforce any right or supposed right; or Fifth.—By means of criminal force, or show of criminal force, to compel any person to do what he is not legally bound to do, or to omit to do what he is legally entitled to do.",
    "punishment": "See Section 143",
    "category": "Offences Against the Public Tranquillity",
    "chapter": "Chapter VIII",
    "keywords": ["unlawful assembly", "common object", "five or more persons"],
    "severity": "medium",
    "bailable": "Bailable",
    "cognizable": "Cognizable",
    "relatedSections": ["Section 142", "Section 143", "Section 149"],
    "caseStudies": []
  },
  {
    "section": "Section 143",
    "title": "Punishment for being a member of an unlawful assembly",
    "description": "Whoever is a member of an unlawful assembly, shall be punished with imprisonment of either description for a term which may extend to six months, or with fine, or with both.",
    "punishment": "Imprisonment for up to 6 months, or fine, or both.",
    "category": "Offences Against the Public Tranquillity",
    "chapter": "Chapter VIII",
    "keywords": ["punishment", "unlawful assembly"],
    "severity": "low",
    "bailable": "Bailable",
    "cognizable": "Cognizable",
    "relatedSections": ["Section 141", "Section 142"],
    "caseStudies": []
  },
  {
    "section": "Section 146",
    "title": "Rioting",
    "description": "Whenever force or violence is used by an unlawful assembly, or by any member thereof, in prosecution of the common object of such assembly, every member of such assembly is guilty of the offence of rioting.",
    "punishment": "See Section 147",
    "category": "Offences Against the Public Tranquillity",
    "chapter": "Chapter VIII",
    "keywords": ["rioting", "force", "violence", "unlawful assembly"],
    "severity": "medium",
    "bailable": "Bailable",
    "cognizable": "Cognizable",
    "relatedSections": ["Section 141", "Section 147", "Section 148"],
    "caseStudies": []
  },
  {
    "section": "Section 147",
    "title": "Punishment for rioting",
    "description": "Whoever is guilty of rioting, shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both.",
    "punishment": "Imprisonment for up to 2 years, or fine, or both.",
    "category": "Offences Against the Public Tranquillity",
    "chapter": "Chapter VIII",
    "keywords": ["punishment", "rioting"],
    "severity": "medium",
    "bailable": "Bailable",
    "cognizable": "Cognizable",
    "relatedSections": ["Section 146", "Section 148"],
    "caseStudies": []
  },
  {
    "section": "Section 153A",
    "title": "Promoting enmity between different groups on grounds of religion, race, place of birth, residence, language, etc., and doing acts prejudicial to maintenance of harmony",
    "description": "Whoever (a) by words, either spoken or written, or by signs or by visible representations or otherwise, promotes or attempts to promote, on grounds of religion, race, place of birth, residence, language, caste or community or any other ground whatsoever, disharmony or feelings of enmity, hatred or ill-will between different religious, racial, language or regional groups or castes or communities, or (b) commits any act which is prejudicial to the maintenance of harmony between different religious, racial, language or regional groups or castes or communities, and which disturbs or is likely to disturb the public tranquillity, [...] shall be punished with imprisonment which may extend to three years, or with fine, or with both.",
    "punishment": "Imprisonment for up to 3 years, or fine, or both. If offence is committed in a place of worship, etc., imprisonment up to 5 years and fine.",
    "category": "Offences Against the Public Tranquillity",
    "chapter": "Chapter VIII",
    "keywords": ["hate speech", "enmity", "disharmony", "religion", "race"],
    "severity": "high",
    "bailable": "Non-bailable",
    "cognizable": "Cognizable",
    "relatedSections": ["Section 124A", "Section 295A", "Section 505"],
    "caseStudies": []
  },
  {
    "section": "Section 191",
    "title": "Giving false evidence",
    "description": "Whoever, being legally bound by an oath or by an express provision of law to state the truth, or being bound by law to make a declaration upon any subject, makes any statement which is false, and which he either knows or believes to be false or does not believe to be true, is said to give false evidence.",
    "punishment": "See Section 193",
    "category": "False Evidence and Offences Against Public Justice",
    "chapter": "Chapter XI",
    "keywords": ["false evidence", "perjury", "false statement", "oath"],
    "severity": "medium",
    "bailable": "Bailable",
    "cognizable": "Non-cognizable",
    "relatedSections": ["Section 192", "Section 193"],
    "caseStudies": []
  },
  {
    "section": "Section 192",
    "title": "Fabricating false evidence",
    "description": "Whoever causes any circumstance to exist or makes any false entry in any book or record, or electronic record or makes any document or electronic record containing a false statement, intending that such circumstance, false entry or false statement may appear in evidence in a judicial proceeding... and that such circumstance, false entry or false statement, so appearing in evidence, may cause any person who in such proceeding is to form an opinion upon the evidence, to entertain an erroneous opinion touching any point material to the result of such proceeding is said 'to fabricate false evidence'.",
    "punishment": "See Section 193",
    "category": "False Evidence and Offences Against Public Justice",
    "chapter": "Chapter XI",
    "keywords": ["fabricating evidence", "false document", "tampering"],
    "severity": "medium",
    "bailable": "Bailable",
    "cognizable": "Non-cognizable",
    "relatedSections": ["Section 191", "Section 193"],
    "caseStudies": []
  },
  {
    "section": "Section 193",
    "title": "Punishment for false evidence",
    "description": "Whoever intentionally gives false evidence in any stage of a judicial proceeding, or fabricates false evidence for the purpose of being used in any stage of a judicial proceeding, shall be punished with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine; and whoever intentionally gives or fabricates false evidence in any other case, shall be punished with imprisonment of either description for a term which may extend to three years, and shall also be liable to fine.",
    "punishment": "Imprisonment for up to 7 years and fine (if in judicial proceeding); or imprisonment for up to 3 years and fine (in other cases).",
    "category": "False Evidence and Offences Against Public Justice",
    "chapter": "Chapter XI",
    "keywords": ["punishment", "false evidence", "perjury"],
    "severity": "medium",
    "bailable": "Bailable",
    "cognizable": "Non-cognizable",
    "relatedSections": ["Section 191", "Section 192"],
    "caseStudies": []
  },
  {
    "section": "Section 295",
    "title": "Injuring or defiling place of worship with intent to insult the religion of any class",
    "description": "Whoever destroys, damages or defiles any place of worship, or any object held sacred by any class of persons with the intention of thereby insulting the religion of any class of persons or with the knowledge that any class of persons is likely to consider such destruction, damage or defilement as an insult to their religion, shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both.",
    "punishment": "Imprisonment for up to 2 years, or fine, or both.",
    "category": "Offences relating to Religion",
    "chapter": "Chapter XV",
    "keywords": ["defiling", "place of worship", "insulting religion", "sacred object"],
    "severity": "medium",
    "bailable": "Non-bailable",
    "cognizable": "Cognizable",
    "relatedSections": ["Section 295A"],
    "caseStudies": []
  },
  {
    "section": "Section 295A",
    "title": "Deliberate and malicious acts, intended to outrage religious feelings of any class by insulting its religion or religious beliefs",
    "description": "Whoever, with deliberate and malicious intention of outraging the religious feelings of any class of citizens of India, by words, either spoken or written, or by signs or by visible representations or otherwise, insults or attempts to insult the religion or the religious beliefs of that class, shall be punished with imprisonment of either description for a term which may extend to three years, or with fine, or with both.",
    "punishment": "Imprisonment for up to 3 years, or with fine, or with both.",
    "category": "Offences relating to Religion",
    "chapter": "Chapter XV",
    "keywords": ["blasphemy", "outraging religious feelings", "insulting religion"],
    "severity": "high",
    "bailable": "Non-bailable",
    "cognizable": "Cognizable",
    "relatedSections": ["Section 153A", "Section 295"],
    "caseStudies": []
  },
  {
    "section": "Section 299",
    "title": "Culpable homicide",
    "description": "Whoever causes death by doing an act with the intention of causing death, or with the intention of causing such bodily injury as is likely to cause death, or with the knowledge that he is likely by such act to cause death, commits the offence of culpable homicide.",
    "punishment": "See Section 304",
    "category": "Of offences affecting life",
    "chapter": "Chapter XVI",
    "keywords": ["culpable homicide", "causing death", "intention to kill"],
    "severity": "high",
    "bailable": "Non-bailable",
    "cognizable": "Cognizable",
    "relatedSections": ["Section 300", "Section 304"],
    "caseStudies": []
  },
  {
    "section": "Section 300",
    "title": "Murder",
    "description": "Except in the cases hereinafter excepted, culpable homicide is murder, if the act by which the death is caused is done with the intention of causing death, or— 2ndly.—If it is done with the intention of causing such bodily injury as the offender knows to be likely to cause the death of the person to whom the harm is caused, or— 3rdly.—If it is done with the intention of causing bodily injury to any person and the bodily injury intended to be inflicted is sufficient in the ordinary course of nature to cause death, or— 4thly.—If the person committing the act knows that it is so imminently dangerous that it must, in all probability, cause death or such bodily injury as is likely to cause death, and commits such act without any excuse for incurring the risk of causing death or such injury as aforesaid.",
    "punishment": "See Section 302",
    "category": "Of offences affecting life",
    "chapter": "Chapter XVI",
    "keywords": ["murder", "intention to kill", "culpable homicide amounting to murder"],
    "severity": "high",
    "bailable": "Non-bailable",
    "cognizable": "Cognizable",
    "relatedSections": ["Section 299", "Section 302", "Section 304"],
    "caseStudies": ["K. M. Nanavati v. State of Maharashtra"]
  },
  {
    "section": "Section 302",
    "title": "Punishment for murder",
    "description": "Whoever commits murder shall be punished with death, or imprisonment for life, and shall also be liable to fine.",
    "punishment": "Death, or imprisonment for life, and fine.",
    "category": "Of offences affecting life",
    "chapter": "Chapter XVI",
    "keywords": ["punishment for murder", "death penalty", "life imprisonment"],
    "severity": "high",
    "bailable": "Non-bailable",
    "cognizable": "Cognizable",
    "relatedSections": ["Section 300"],
    "caseStudies": ["Bachan Singh vs State of Punjab", "Machhi Singh vs State of Punjab"]
  },
  {
    "section": "Section 304",
    "title": "Punishment for culpable homicide not amounting to murder",
    "description": "Whoever commits culpable homicide not amounting to murder shall be punished with imprisonment for life, or imprisonment of either description for a term which may extend to ten years, and shall also be liable to fine, if the act by which the death is caused is done with the intention of causing death, or of causing such bodily injury as is likely to cause death; or with imprisonment of either description for a term which may extend to ten years, or with fine, or with both, if the act is done with the knowledge that it is likely to cause death, but without any intention to cause death, or to cause such bodily injury as is likely to cause death.",
    "punishment": "Imprisonment for life, or imprisonment for up to 10 years, and fine.",
    "category": "Of offences affecting life",
    "chapter": "Chapter XVI",
    "keywords": ["culpable homicide", "not amounting to murder", "punishment"],
    "severity": "high",
    "bailable": "Non-bailable",
    "cognizable": "Cognizable",
    "relatedSections": ["Section 299", "Section 300"],
    "caseStudies": []
  },
  {
    "section": "Section 304A",
    "title": "Causing death by negligence",
    "description": "Whoever causes the death of any person by doing any rash or negligent act not amounting to culpable homicide, shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both.",
    "punishment": "Imprisonment for up to 2 years, or fine, or both.",
    "category": "Of offences affecting life",
    "chapter": "Chapter XVI",
    "keywords": ["death by negligence", "rash driving", "medical negligence"],
    "severity": "medium",
    "bailable": "Bailable",
    "cognizable": "Cognizable",
    "relatedSections": ["Section 279"],
    "caseStudies": ["Jacob Mathew v. State of Punjab"]
  },
  {
    "section": "Section 304B",
    "title": "Dowry death",
    "description": "Where the death of a woman is caused by any burns or bodily injury or occurs otherwise than under normal circumstances within seven years of her marriage and it is shown that soon before her death she was subjected to cruelty or harassment by her husband or any relative of her husband for, or in connection with, any demand for dowry, such death shall be called “dowry death”, and such husband or relative shall be deemed to have caused her death.",
    "punishment": "Imprisonment for a term not less than 7 years but which may extend to imprisonment for life.",
    "category": "Of offences affecting life",
    "chapter": "Chapter XVI",
    "keywords": ["dowry death", "cruelty", "harassment", "marriage"],
    "severity": "high",
    "bailable": "Non-bailable",
    "cognizable": "Cognizable",
    "relatedSections": ["Section 498A"],
    "caseStudies": []
  },
  {
    "section": "Section 306",
    "title": "Abetment of suicide",
    "description": "If any person commits suicide, whoever abets the commission of such suicide, shall be punished with imprisonment of either description for a term which may extend to ten years, and shall also be liable to fine.",
    "punishment": "Imprisonment for up to 10 years, and fine.",
    "category": "Of offences affecting life",
    "chapter": "Chapter XVI",
    "keywords": ["abetment of suicide", "instigation", "suicide"],
    "severity": "high",
    "bailable": "Non-bailable",
    "cognizable": "Cognizable",
    "relatedSections": ["Section 305", "Section 309"],
    "caseStudies": []
  },
  {
    "section": "Section 307",
    "title": "Attempt to murder",
    "description": "Whoever does any act with such intention or knowledge, and under such circumstances that, if he by that act caused death, he would be guilty of murder, shall be punished with imprisonment of either description for a term which may extend to ten years, and shall also be liable to fine; and if hurt is caused to any person by such act, the offender shall be liable either to imprisonment for life, or to such punishment as is hereinbefore mentioned.",
    "punishment": "Imprisonment for up to 10 years and fine; if hurt is caused, imprisonment for life or up to 10 years and fine. If already a life-convict, may be punished with death.",
    "category": "Of offences affecting life",
    "chapter": "Chapter XVI",
    "keywords": ["attempt to murder", "intention to kill", "hurt"],
    "severity": "high",
    "bailable": "Non-bailable",
    "cognizable": "Cognizable",
    "relatedSections": ["Section 300", "Section 308"],
    "caseStudies": []
  },
  {
    "section": "Section 309",
    "title": "Attempt to commit suicide",
    "description": "Whoever attempts to commit suicide and does any act towards the commission of such offence, shall be punished with simple imprisonment for a term which may extend to one year or with fine, or with both.",
    "punishment": "Simple imprisonment for up to 1 year, or fine, or both.",
    "category": "Of offences affecting life",
    "chapter": "Chapter XVI",
    "keywords": ["attempt to suicide", "self-harm"],
    "severity": "low",
    "bailable": "Bailable",
    "cognizable": "Non-cognizable",
    "relatedSections": ["Section 306"],
    "caseStudies": ["Common Cause (A Registered Society) v. Union of India (decriminalization debate)"]
  },
  {
    "section": "Section 323",
    "title": "Punishment for voluntarily causing hurt",
    "description": "Whoever, except in the case provided for by section 334, voluntarily causes hurt, shall be punished with imprisonment of either description for a term which may extend to one year, or with fine which may extend to one thousand rupees, or with both.",
    "punishment": "Imprisonment for up to 1 year, or fine up to Rs. 1000, or both.",
    "category": "Of Hurt",
    "chapter": "Chapter XVI",
    "keywords": ["hurt", "assault", "bodily pain"],
    "severity": "low",
    "bailable": "Bailable",
    "cognizable": "Non-cognizable",
    "relatedSections": ["Section 319", "Section 321", "Section 324"],
    "caseStudies": []
  },
  {
    "section": "Section 324",
    "title": "Voluntarily causing hurt by dangerous weapons or means",
    "description": "Whoever, except in the case provided for by section 334, voluntarily causes hurt by means of any instrument for shooting, stabbing or cutting, or any instrument which, used as a weapon of offence, is likely to cause death, or by means of fire or any heated substance, or by means of any poison or any corrosive substance, or by means of any explosive substance or by means of any substance which it is deleterious to the human body to inhale, to swallow, or to receive into the blood, or by means of any animal, shall be punished with imprisonment of either description for a term which may extend to three years, or with fine, or with both.",
    "punishment": "Imprisonment for up to 3 years, or fine, or both.",
    "category": "Of Hurt",
    "chapter": "Chapter XVI",
    "keywords": ["hurt", "dangerous weapon", "stabbing", "poison"],
    "severity": "medium",
    "bailable": "Non-bailable",
    "cognizable": "Cognizable",
    "relatedSections": ["Section 323", "Section 326"],
    "caseStudies": []
  },
  {
    "section": "Section 325",
    "title": "Punishment for voluntarily causing grievous hurt",
    "description": "Whoever, except in the case provided for by section 335, voluntarily causes grievous hurt, shall be punished with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine.",
    "punishment": "Imprisonment for up to 7 years, and fine.",
    "category": "Of Hurt",
    "chapter": "Chapter XVI",
    "keywords": ["grievous hurt", "severe bodily pain"],
    "severity": "medium",
    "bailable": "Bailable",
    "cognizable": "Cognizable",
    "relatedSections": ["Section 320", "Section 322", "Section 326"],
    "caseStudies": []
  },
  {
    "section": "Section 326",
    "title": "Voluntarily causing grievous hurt by dangerous weapons or means",
    "description": "Whoever, except in the case provided for by section 335, voluntarily causes grievous hurt by means of any instrument for shooting, stabbing or cutting, or any instrument which, used as a weapon of offence, is likely to cause death, or by means of fire or any heated substance, or by means of any poison or any corrosive substance, or by means of any explosive substance, or by means of any substance which it is deleterious to the human body to inhale, to swallow, or to receive into the blood, or by means of any animal, shall be punished with imprisonment for life, or with imprisonment of either description for a term which may extend to ten years, and shall also be liable to fine.",
    "punishment": "Imprisonment for life, or imprisonment for up to 10 years, and fine.",
    "category": "Of Hurt",
    "chapter": "Chapter XVI",
    "keywords": ["grievous hurt", "dangerous weapon", "acid attack"],
    "severity": "high",
    "bailable": "Non-bailable",
    "cognizable": "Cognizable",
    "relatedSections": ["Section 325", "Section 326A"],
    "caseStudies": []
  },
  {
    "section": "Section 326A",
    "title": "Voluntarily causing grievous hurt by use of acid, etc.",
    "description": "Whoever causes permanent or partial damage or deformity to, or burns or maims or disfigures or disables, any part or parts of the body of a person or causes grievous hurt by throwing acid on or by administering acid to that person, or by using any other means with the intention of causing or with the knowledge that he is likely to cause such injury or hurt, shall be punished with imprisonment of either description for a term which shall not be less than ten years but which may extend to imprisonment for life, and with fine.",
    "punishment": "Imprisonment of not less than 10 years, which may extend to life imprisonment, and fine (which shall be paid to the victim).",
    "category": "Of Hurt",
    "chapter": "Chapter XVI",
    "keywords": ["acid attack", "grievous hurt", "disfigurement"],
    "severity": "high",
    "bailable": "Non-bailable",
    "cognizable": "Cognizable",
    "relatedSections": ["Section 326", "Section 326B"],
    "caseStudies": ["Laxmi v. Union of India"]
  },
  {
    "section": "Section 339",
    "title": "Wrongful restraint",
    "description": "Whoever voluntarily obstructs any person so as to prevent that person from proceeding in any direction in which that person has a right to proceed, is said wrongfully to restrain that person.",
    "punishment": "See Section 341",
    "category": "Of wrongful restraint and wrongful confinement",
    "chapter": "Chapter XVI",
    "keywords": ["wrongful restraint", "obstruction", "preventing movement"],
    "severity": "low",
    "bailable": "Bailable",
    "cognizable": "Cognizable",
    "relatedSections": ["Section 340", "Section 341"],
    "caseStudies": []
  },
  {
    "section": "Section 340",
    "title": "Wrongful confinement",
    "description": "Whoever wrongfully restrains any person in such a manner as to prevent that person from proceeding beyond certain circumscribing limits, is said 'wrongfully to confine' that person.",
    "punishment": "See Section 342",
    "category": "Of wrongful restraint and wrongful confinement",
    "chapter": "Chapter XVI",
    "keywords": ["wrongful confinement", "detention", "imprisonment"],
    "severity": "medium",
    "bailable": "Bailable",
    "cognizable": "Cognizable",
    "relatedSections": ["Section 339", "Section 342", "Section 343", "Section 344"],
    "caseStudies": []
  },
  {
    "section": "Section 351",
    "title": "Assault",
    "description": "Whoever makes any gesture, or any preparation intending or knowing it to be likely that such gesture or preparation will cause any person present to apprehend that he who makes that gesture or preparation is about to use criminal force to that person, is said to commit an assault.",
    "punishment": "See Section 352",
    "category": "Of Criminal Force and Assault",
    "chapter": "Chapter XVI",
    "keywords": ["assault", "threat", "apprehension of force"],
    "severity": "low",
    "bailable": "Bailable",
    "cognizable": "Non-cognizable",
    "relatedSections": ["Section 350", "Section 352"],
    "caseStudies": []
  },
  {
    "section": "Section 354",
    "title": "Assault or criminal force to woman with intent to outrage her modesty",
    "description": "Whoever assaults or uses criminal force to any woman, intending to outrage or knowing it to be likely that he will thereby outrage her modesty, shall be punished with imprisonment of either description for a term which shall not be less than one year but which may extend to five years, and shall also be liable to fine.",
    "punishment": "Imprisonment for a term not less than 1 year, but which may extend to 5 years, and fine.",
    "category": "Of Criminal Force and Assault",
    "chapter": "Chapter XVI",
    "keywords": ["outraging modesty", "assault on woman", "molestation"],
    "severity": "medium",
    "bailable": "Non-bailable",
    "cognizable": "Cognizable",
    "relatedSections": ["Section 354A", "Section 354B", "Section 354C", "Section 354D", "Section 509"],
    "caseStudies": []
  },
  {
    "section": "Section 354A",
    "title": "Sexual harassment and punishment for sexual harassment",
    "description": "A man committing any of the following acts—(i) physical contact and advances involving unwelcome and explicit sexual overtures; or (ii) a demand or request for sexual favours; or (iii) showing pornography against the will of a woman; or (iv) making sexually coloured remarks, shall be guilty of the offence of sexual harassment.",
    "punishment": "(i), (ii), (iii): Rigorous imprisonment up to 3 years, or fine, or both. (iv): Imprisonment up to 1 year, or fine, or both.",
    "category": "Of Criminal Force and Assault",
    "chapter": "Chapter XVI",
    "keywords": ["sexual harassment", "unwelcome advances", "pornography", "lewd remarks"],
    "severity": "medium",
    "bailable": "Bailable",
    "cognizable": "Cognizable",
    "relatedSections": ["Section 354", "Section 509"],
    "caseStudies": []
  },
  {
    "section": "Section 354D",
    "title": "Stalking",
    "description": "(1) Any man who— (i) follows a woman and contacts, or attempts to contact such woman to foster personal interaction repeatedly despite a clear indication of disinterest by such woman; or (ii) monitors the use by a woman of the internet, email or any other form of electronic communication, commits the offence of stalking.",
    "punishment": "First conviction: Imprisonment up to 3 years and fine. Second or subsequent conviction: Imprisonment up to 5 years and fine.",
    "category": "Of Criminal Force and Assault",
    "chapter": "Chapter XVI",
    "keywords": ["stalking", "following", "cyberstalking", "harassment"],
    "severity": "medium",
    "bailable": "Bailable",
    "cognizable": "Cognizable",
    "relatedSections": ["Section 354", "Section 509"],
    "caseStudies": []
  },
  {
    "section": "Section 359",
    "title": "Kidnapping",
    "description": "Kidnapping is of two kinds: kidnapping from India, and kidnapping from lawful guardianship.",
    "punishment": "See Section 363",
    "category": "Of Kidnapping, Abduction, Slavery and Forced Labour",
    "chapter": "Chapter XVI",
    "keywords": ["kidnapping", "abduction", "lawful guardianship"],
    "severity": "high",
    "bailable": "Non-bailable",
    "cognizable": "Cognizable",
    "relatedSections": ["Section 360", "Section 361", "Section 363"],
    "caseStudies": []
  },
  {
    "section": "Section 362",
    "title": "Abduction",
    "description": "Whoever by force compels, or by any deceitful means induces, any person to go from any place, is said to abduct that person.",
    "punishment": "Punishment depends on the intent/purpose of abduction, see related sections.",
    "category": "Of Kidnapping, Abduction, Slavery and Forced Labour",
    "chapter": "Chapter XVI",
    "keywords": ["abduction", "force", "deceit", "compulsion"],
    "severity": "high",
    "bailable": "Non-bailable",
    "cognizable": "Cognizable",
    "relatedSections": ["Section 364", "Section 365", "Section 366"],
    "caseStudies": []
  },
  {
    "section": "Section 375",
    "title": "Rape",
    "description": "A man is said to commit 'rape' if he penetrates his penis, to any extent, into the vagina, mouth, urethra or anus of a woman or makes her to do so with him or any other person; or inserts, to any extent, any object or a part of the body, not being the penis, into the vagina, the urethra or anus of a woman or makes her to do so with him or any other person; or manipulates any part of the body of a woman so as to cause penetration into the vagina, urethra, anus or any part of body of such woman or makes her to do so with him or any other person; or applies his mouth to the vagina, anus, urethra of a woman or makes her to do so with him or any other person, under circumstances falling under any of the seven descriptions provided in the section (against her will, without consent, etc.).",
    "punishment": "See Sections 376, 376A, 376B, 376C, 376D, 376E.",
    "category": "Sexual offences",
    "chapter": "Chapter XVI",
    "keywords": ["rape", "sexual assault", "penetration", "consent"],
    "severity": "high",
    "bailable": "Non-bailable",
    "cognizable": "Cognizable",
    "relatedSections": ["Section 376"],
    "caseStudies": ["Tukaram v. State of Maharashtra (Mathura rape case)"]
  },
  {
    "section": "Section 376",
    "title": "Punishment for rape",
    "description": "(1) Whoever, except in the cases provided for in sub-section (2), commits rape, shall be punished with rigorous imprisonment of either description for a term which shall not be less than ten years, but which may extend to imprisonment for life, and shall also be liable to fine. (2) Provides for aggravated forms of rape (by police officer, public servant, on pregnant woman, etc.) with a punishment of rigorous imprisonment for not less than ten years, extendable to life imprisonment (meaning for the remainder of that person's natural life), and fine. (3) Provides for rape on a woman under sixteen years with rigorous imprisonment for a term not less than twenty years, extendable to life imprisonment, and fine.",
    "punishment": "Minimum 10 years rigorous imprisonment, up to life imprisonment, and fine. Aggravated cases have stricter punishments.",
    "category": "Sexual offences",
    "chapter": "Chapter XVI",
    "keywords": ["punishment for rape", "gang rape", "custodial rape"],
    "severity": "high",
    "bailable": "Non-bailable",
    "cognizable": "Cognizable",
    "relatedSections": ["Section 375", "Section 376A", "Section 376D"],
    "caseStudies": []
  },
  {
    "section": "Section 377",
    "title": "Unnatural offences",
    "description": "Whoever voluntarily has carnal intercourse against the order of nature with any man, woman or animal, shall be punished with imprisonment for life, or with imprisonment of either description for a term which may extend to ten years, and shall also be liable to fine.",
    "punishment": "Imprisonment for life, or imprisonment up to 10 years, and fine.",
    "category": "Of Unnatural offences",
    "chapter": "Chapter XVI",
    "keywords": ["unnatural sex", "sodomy", "bestiality"],
    "severity": "high",
    "bailable": "Non-bailable",
    "cognizable": "Cognizable",
    "relatedSections": [],
    "caseStudies": ["Navtej Singh Johar v. Union of India (decriminalizing consensual homosexual acts)"]
  },
  {
    "section": "Section 378",
    "title": "Theft",
    "description": "Whoever, intending to take dishonestly any movable property out of the possession of any person without that person's consent, moves that property in order to such taking, is said to commit theft.",
    "punishment": "See Section 379",
    "category": "Of theft",
    "chapter": "Chapter XVII",
    "keywords": ["theft", "stealing", "movable property", "dishonest intention"],
    "severity": "medium",
    "bailable": "Non-bailable",
    "cognizable": "Cognizable",
    "relatedSections": ["Section 379", "Section 380", "Section 381", "Section 382"],
    "caseStudies": []
  },
  {
    "section": "Section 379",
    "title": "Punishment for theft",
    "description": "Whoever commits theft shall be punished with imprisonment of either description for a term which may extend to three years, or with fine, or with both.",
    "punishment": "Imprisonment for up to 3 years, or fine, or both.",
    "category": "Of theft",
    "chapter": "Chapter XVII",
    "keywords": ["punishment for theft", "imprisonment"],
    "severity": "medium",
    "bailable": "Non-bailable",
    "cognizable": "Cognizable",
    "relatedSections": ["Section 378"],
    "caseStudies": []
  },
  {
    "section": "Section 383",
    "title": "Extortion",
    "description": "Whoever intentionally puts any person in fear of any injury to that person, or to any other, and thereby dishonestly induces the person so put in fear to deliver to any person any property or valuable security, or anything signed or sealed which may be converted into a valuable security, commits 'extortion'.",
    "punishment": "See Section 384",
    "category": "Of extortion",
    "chapter": "Chapter XVII",
    "keywords": ["extortion", "blackmail", "fear of injury", "threat"],
    "severity": "medium",
    "bailable": "Non-bailable",
    "cognizable": "Cognizable",
    "relatedSections": ["Section 384", "Section 385", "Section 386"],
    "caseStudies": []
  },
  {
    "section": "Section 384",
    "title": "Punishment for extortion",
    "description": "Whoever commits extortion shall be punished with imprisonment of either description for a term which may extend to three years, or with fine, or with both.",
    "punishment": "Imprisonment for up to 3 years, or fine, or both.",
    "category": "Of extortion",
    "chapter": "Chapter XVII",
    "keywords": ["punishment for extortion"],
    "severity": "medium",
    "bailable": "Non-bailable",
    "cognizable": "Cognizable",
    "relatedSections": ["Section 383"],
    "caseStudies": []
  },
  {
    "section": "Section 390",
    "title": "Robbery",
    "description": "In all robbery there is either theft or extortion. Theft is 'robbery' if, in order to the committing of the theft, or in committing the theft, or in carrying away or attempting to carry away property obtained by the theft, the offender, for that end, voluntarily causes or attempts to cause to any person death or hurt or wrongful restraint, or fear of instant death or of instant hurt, or of instant wrongful restraint. Extortion is 'robbery' if the offender, at the time of committing the extortion, is in the presence of the person put in fear, and commits the extortion by putting that person in fear of instant death, of instant hurt, or of instant wrongful restraint to that person or to some other person, and, by so putting in fear, induces the person so put in fear then and there to deliver up the thing extorted.",
    "punishment": "See Section 392",
    "category": "Of robbery and dacoity",
    "chapter": "Chapter XVII",
    "keywords": ["robbery", "theft with violence", "extortion with threat"],
    "severity": "high",
    "bailable": "Non-bailable",
    "cognizable": "Cognizable",
    "relatedSections": ["Section 378", "Section 383", "Section 392", "Section 391"],
    "caseStudies": []
  },
  {
    "section": "Section 391",
    "title": "Dacoity",
    "description": "When five or more persons conjointly commit or attempt to commit a robbery, or where the whole number of persons conjointly committing or attempting to commit a robbery, and persons present and aiding such commission or attempt, amount to five or more, every person so committing, attempting or aiding, is said to commit 'dacoity'.",
    "punishment": "See Section 395",
    "category": "Of robbery and dacoity",
    "chapter": "Chapter XVII",
    "keywords": ["dacoity", "gang robbery", "five or more persons"],
    "severity": "high",
    "bailable": "Non-bailable",
    "cognizable": "Cognizable",
    "relatedSections": ["Section 390", "Section 395"],
    "caseStudies": []
  },
  {
    "section": "Section 392",
    "title": "Punishment for robbery",
    "description": "Whoever commits robbery shall be punished with rigorous imprisonment for a term which may extend to ten years, and shall also be liable to fine; and, if the robbery be committed on the highway between sunset and sunrise, the imprisonment may be extended to fourteen years.",
    "punishment": "Rigorous imprisonment up to 10 years and fine. Up to 14 years if on a highway between sunset and sunrise.",
    "category": "Of robbery and dacoity",
    "chapter": "Chapter XVII",
    "keywords": ["punishment for robbery"],
    "severity": "high",
    "bailable": "Non-bailable",
    "cognizable": "Cognizable",
    "relatedSections": ["Section 390"],
    "caseStudies": []
  },
  {
    "section": "Section 395",
    "title": "Punishment for dacoity",
    "description": "Whoever commits dacoity shall be punished with imprisonment for life, or with rigorous imprisonment for a term which may extend to ten years, and shall also be liable to fine.",
    "punishment": "Imprisonment for life, or rigorous imprisonment up to 10 years, and fine.",
    "category": "Of robbery and dacoity",
    "chapter": "Chapter XVII",
    "keywords": ["punishment for dacoity"],
    "severity": "high",
    "bailable": "Non-bailable",
    "cognizable": "Cognizable",
    "relatedSections": ["Section 391"],
    "caseStudies": []
  },
  {
    "section": "Section 396",
    "title": "Dacoity with murder",
    "description": "If any one of five or more persons, who are conjointly committing dacoity, commits murder in so committing dacoity, every one of those persons shall be punished with death, or imprisonment for life, or rigorous imprisonment for a term which may extend to ten years, and shall also be liable to fine.",
    "punishment": "Death, or imprisonment for life, or rigorous imprisonment up to 10 years, and fine.",
    "category": "Of robbery and dacoity",
    "chapter": "Chapter XVII",
    "keywords": ["dacoity with murder", "joint liability"],
    "severity": "high",
    "bailable": "Non-bailable",
    "cognizable": "Cognizable",
    "relatedSections": ["Section 391", "Section 300"],
    "caseStudies": []
  },
  {
    "section": "Section 403",
    "title": "Dishonest misappropriation of property",
    "description": "Whoever dishonestly misappropriates or converts to his own use any movable property, shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both.",
    "punishment": "Imprisonment for up to 2 years, or fine, or both.",
    "category": "Of criminal misappropriation of property",
    "chapter": "Chapter XVII",
    "keywords": ["misappropriation", "dishonest", "conversion of property"],
    "severity": "medium",
    "bailable": "Bailable",
    "cognizable": "Non-cognizable",
    "relatedSections": ["Section 405"],
    "caseStudies": []
  },
  {
    "section": "Section 405",
    "title": "Criminal breach of trust",
    "description": "Whoever, being in any manner entrusted with property, or with any dominion over property, dishonestly misappropriates or converts to his own use that property, or dishonestly uses or disposes of that property in violation of any direction of law prescribing the mode in which such trust is to be discharged, or of any legal contract, express or implied, which he has made touching the discharge of such trust, or wilfully suffers any other person so to do, commits 'criminal breach of trust'.",
    "punishment": "See Section 406",
    "category": "Of criminal breach of trust",
    "chapter": "Chapter XVII",
    "keywords": ["criminal breach of trust", "entrustment", "misappropriation"],
    "severity": "medium",
    "bailable": "Non-bailable",
    "cognizable": "Cognizable",
    "relatedSections": ["Section 406", "Section 407", "Section 408", "Section 409"],
    "caseStudies": []
  },
  {
    "section": "Section 406",
    "title": "Punishment for criminal breach of trust",
    "description": "Whoever commits criminal breach of trust shall be punished with imprisonment of either description for a term which may extend to three years, or with fine, or with both.",
    "punishment": "Imprisonment for up to 3 years, or fine, or both.",
    "category": "Of criminal breach of trust",
    "chapter": "Chapter XVII",
    "keywords": ["punishment", "criminal breach of trust"],
    "severity": "medium",
    "bailable": "Non-bailable",
    "cognizable": "Cognizable",
    "relatedSections": ["Section 405"],
    "caseStudies": []
  },
  {
    "section": "Section 415",
    "title": "Cheating",
    "description": "Whoever, by deceiving any person, fraudulently or dishonestly induces the person so deceived to deliver any property to any person, or to consent that any person shall retain any property, or intentionally induces the person so deceived to do or omit to do anything which he would not do or omit if he were not so deceived, and which act or omission causes or is likely to cause damage or harm to that person in body, mind, reputation or property, is said to 'cheat'.",
    "punishment": "See Section 417",
    "category": "Of Cheating",
    "chapter": "Chapter XVII",
    "keywords": ["cheating", "deception", "fraud", "dishonest inducement"],
    "severity": "medium",
    "bailable": "Bailable",
    "cognizable": "Non-cognizable",
    "relatedSections": ["Section 416", "Section 417", "Section 420"],
    "caseStudies": []
  },
  {
    "section": "Section 417",
    "title": "Punishment for cheating",
    "description": "Whoever cheats shall be punished with imprisonment of either description for a term which may extend to one year, or with fine, or with both.",
    "punishment": "Imprisonment for up to 1 year, or fine, or both.",
    "category": "Of Cheating",
    "chapter": "Chapter XVII",
    "keywords": ["punishment for cheating"],
    "severity": "low",
    "bailable": "Bailable",
    "cognizable": "Non-cognizable",
    "relatedSections": ["Section 415"],
    "caseStudies": []
  },
  {
    "section": "Section 420",
    "title": "Cheating and dishonestly inducing delivery of property",
    "description": "Whoever cheats and thereby dishonestly induces the person deceived to deliver any property to any person, or to make, alter or destroy the whole or any part of a valuable security, or anything which is signed or sealed, and which is capable of being converted into a valuable security, shall be punished with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine.",
    "punishment": "Imprisonment for up to 7 years, and fine.",
    "category": "Of Cheating",
    "chapter": "Chapter XVII",
    "keywords": ["cheating", "delivery of property", "valuable security"],
    "severity": "medium",
    "bailable": "Non-bailable",
    "cognizable": "Cognizable",
    "relatedSections": ["Section 415"],
    "caseStudies": []
  },
  {
    "section": "Section 425",
    "title": "Mischief",
    "description": "Whoever with intent to cause, or knowing that he is likely to cause, wrongful loss or damage to the public or to any person, causes the destruction of any property, or any such change in any property or in the situation thereof as destroys or diminishes its value or utility, or affects it injuriously, commits 'mischief'.",
    "punishment": "See Section 426",
    "category": "Of mischief",
    "chapter": "Chapter XVII",
    "keywords": ["mischief", "vandalism", "property damage", "wrongful loss"],
    "severity": "low",
    "bailable": "Bailable",
    "cognizable": "Non-cognizable",
    "relatedSections": ["Section 426", "Section 427"],
    "caseStudies": []
  },
  {
    "section": "Section 441",
    "title": "Criminal trespass",
    "description": "Whoever enters into or upon property in the possession of another with intent to commit an offence or to intimidate, insult or annoy any person in possession of such property, or, having lawfully entered into or upon such property, unlawfully remains there with intent thereby to intimidate, insult or annoy any such person, or with intent to commit an offence, is said to commit 'criminal trespass'.",
    "punishment": "See Section 447",
    "category": "Of criminal trespass",
    "chapter": "Chapter XVII",
    "keywords": ["trespass", "unlawful entry", "intimidation", "annoyance"],
    "severity": "low",
    "bailable": "Bailable",
    "cognizable": "Cognizable",
    "relatedSections": ["Section 442", "Section 447"],
    "caseStudies": []
  },
  {
    "section": "Section 442",
    "title": "House-trespass",
    "description": "Whoever commits criminal trespass by entering into or remaining in any building, tent or vessel used as a human dwelling or any building used as a place for worship, or as a place for the custody of property, is said to commit 'house-trespass'.",
    "punishment": "See Section 448",
    "category": "Of criminal trespass",
    "chapter": "Chapter XVII",
    "keywords": ["house-trespass", "dwelling", "building"],
    "severity": "medium",
    "bailable": "Bailable",
    "cognizable": "Cognizable",
    "relatedSections": ["Section 441", "Section 448"],
    "caseStudies": []
  },
  {
    "section": "Section 463",
    "title": "Forgery",
    "description": "Whoever makes any false document or false electronic record or part of a document or electronic record, with intent to cause damage or injury, to the public or to any person, or to support any claim or title, or to cause any person to part with property, or to enter into any express or implied contract, or with intent to commit fraud or that fraud may be committed, commits forgery.",
    "punishment": "See Section 465",
    "category": "Of Offences Relating to Documents and to Property Marks",
    "chapter": "Chapter XVIII",
    "keywords": ["forgery", "false document", "fraud", "counterfeit"],
    "severity": "medium",
    "bailable": "Non-bailable",
    "cognizable": "Cognizable",
    "relatedSections": ["Section 464", "Section 465", "Section 467", "Section 468"],
    "caseStudies": []
  },
  {
    "section": "Section 465",
    "title": "Punishment for forgery",
    "description": "Whoever commits forgery shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both.",
    "punishment": "Imprisonment for up to 2 years, or fine, or both.",
    "category": "Of Offences Relating to Documents and to Property Marks",
    "chapter": "Chapter XVIII",
    "keywords": ["punishment for forgery"],
    "severity": "medium",
    "bailable": "Non-bailable",
    "cognizable": "Cognizable",
    "relatedSections": ["Section 463"],
    "caseStudies": []
  },
  {
    "section": "Section 498A",
    "title": "Husband or relative of husband of a woman subjecting her to cruelty",
    "description": "Whoever, being the husband or the relative of the husband of a woman, subjects such woman to cruelty shall be punished with imprisonment for a term which may extend to three years and shall also be liable to fine. Explanation.—For the purpose of this section, 'cruelty' means— (a) any wilful conduct which is of such a nature as is likely to drive the woman to commit suicide or to cause grave injury or danger to life, limb or health (whether mental or physical) of the woman; or (b) harassment of the woman where such harassment is with a view to coercing her or any person related to her to meet any unlawful demand for any property or valuable security or is on account of failure by her or any person related to her to meet such demand.",
    "punishment": "Imprisonment for up to 3 years, and fine.",
    "category": "Of Cruelty by Husband or Relatives of Husband",
    "chapter": "Chapter XXA",
    "keywords": ["cruelty", "domestic violence", "harassment", "dowry demand"],
    "severity": "medium",
    "bailable": "Non-bailable",
    "cognizable": "Cognizable",
    "relatedSections": ["Section 304B"],
    "caseStudies": []
  },
  {
    "section": "Section 499",
    "title": "Defamation",
    "description": "Whoever, by words either spoken or intended to be read, or by signs or by visible representations, makes or publishes any imputation concerning any person intending to harm, or knowing or having reason to believe that such imputation will harm, the reputation of such person, is said, except in the cases hereinafter excepted, to defame that person.",
    "punishment": "See Section 500",
    "category": "Of Defamation",
    "chapter": "Chapter XXI",
    "keywords": ["defamation", "libel", "slander", "reputation"],
    "severity": "low",
    "bailable": "Bailable",
    "cognizable": "Non-cognizable",
    "relatedSections": ["Section 500", "Section 501", "Section 502"],
    "caseStudies": []
  },
  {
    "section": "Section 500",
    "title": "Punishment for defamation",
    "description": "Whoever defames another shall be punished with simple imprisonment for a term which may extend to two years, or with fine, or with both.",
    "punishment": "Simple imprisonment for up to 2 years, or fine, or both.",
    "category": "Of Defamation",
    "chapter": "Chapter XXI",
    "keywords": ["punishment for defamation"],
    "severity": "low",
    "bailable": "Bailable",
    "cognizable": "Non-cognizable",
    "relatedSections": ["Section 499"],
    "caseStudies": []
  },
  {
    "section": "Section 503",
    "title": "Criminal intimidation",
    "description": "Whoever threatens another with any injury to his person, reputation or property, or to the person or reputation of any one in whom that person is interested, with intent to cause alarm to that person, or to cause that person to do any act which he is not legally bound to do, or to omit to do any act which that person is legally entitled to do, as the means of avoiding the execution of such threat, commits criminal intimidation.",
    "punishment": "See Section 506",
    "category": "Of Criminal Intimidation, Insult and Annoyance",
    "chapter": "Chapter XXII",
    "keywords": ["criminal intimidation", "threat", "injury", "alarm"],
    "severity": "medium",
    "bailable": "Bailable",
    "cognizable": "Non-cognizable",
    "relatedSections": ["Section 506", "Section 507"],
    "caseStudies": []
  },
  {
    "section": "Section 506",
    "title": "Punishment for criminal intimidation",
    "description": "Whoever commits the offence of criminal intimidation shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both; If threat be to cause death or grievous hurt, etc.—And if the threat be to cause death or grievous hurt, or to cause the destruction of any property by fire, or to cause an offence punishable with death or imprisonment for life, or with imprisonment for a term which may extend to seven years, or to impute unchastity to a woman, shall be punished with imprisonment of either description for a term which may extend to seven years, or with fine, or with both.",
    "punishment": "Imprisonment for up to 2 years, or fine, or both. If threat is of death/grievous hurt etc., imprisonment up to 7 years, or fine, or both.",
    "category": "Of Criminal Intimidation, Insult and Annoyance",
    "chapter": "Chapter XXII",
    "keywords": ["punishment", "criminal intimidation", "threat"],
    "severity": "medium",
    "bailable": "Bailable",
    "cognizable": "Non-cognizable",
    "relatedSections": ["Section 503"],
    "caseStudies": []
  },
  {
    "section": "Section 509",
    "title": "Word, gesture or act intended to insult the modesty of a woman",
    "description": "Whoever, intending to insult the modesty of any woman, utters any word, makes any sound or gesture, or exhibits any object, intending that such word or sound shall be heard, or that such gesture or object shall be seen, by such woman, or intrudes upon the privacy of such woman, shall be punished with simple imprisonment for a term which may extend to three years, and also with fine.",
    "punishment": "Simple imprisonment for up to 3 years, and fine.",
    "category": "Of Criminal Intimidation, Insult and Annoyance",
    "chapter": "Chapter XXII",
    "keywords": ["insulting modesty", "eve-teasing", "sexual harassment", "privacy"],
    "severity": "low",
    "bailable": "Bailable",
    "cognizable": "Cognizable",
    "relatedSections": ["Section 354", "Section 354A"],
    "caseStudies": []
  },
  {
    "section": "Section 511",
    "title": "Punishment for attempting to commit offences punishable with imprisonment for life or other imprisonment",
    "description": "Whoever attempts to commit an offence punishable by this Code with imprisonment for life or imprisonment, or to cause such an offence to be committed, and in such attempt does any act towards the commission of the offence, shall, where no express provision is made by this Code for the punishment of such attempt, be punished with imprisonment of any description provided for the offence, for a term which may extend to one-half of the imprisonment for life or, as the case may be, one-half of the longest term of imprisonment provided for that offence, or with such fine as is provided for the offence, or with both.",
    "punishment": "Up to one-half of the longest term of imprisonment provided for the offence, or with fine, or with both.",
    "category": "Of Attempts to Commit Offences",
    "chapter": "Chapter XXIII",
    "keywords": ["attempt", "incomplete offence", "preparation"],
    "severity": "depends on the offence attempted",
    "bailable": "Depends on the offence attempted",
    "cognizable": "Depends on the offence attempted",
    "relatedSections": ["Section 307", "Section 308", "Section 309"],
    "caseStudies": ["State of Maharashtra v. Mohd. Yakub"]
  }
]